package com.thinkinjava.basic._10_7;

/**
 * 为什么要使用内部类?
 * 1.内部类继承自某个类或实现某个接口,内部类的代码操作创建它的外围类的对象.
 *  所以可以认为是内部类提供了某种进入其外围类的窗口.
 * 2.如果只是需要一个对接口的引用,可以通过外部类实现接口.
 * 3.每个内部类都能独立地继承自一个(接口的)实现,所以无论外部类是否已经继承了
 *  某个(接口的)实现,对于内部类都没有影响!! 划重点!  😀
 * 4.内部类使得多重继承的解决方案变得完整,也就是说,内部类允许继承多个
 *  非接口类型(类或者抽象类)
 *
 *
 * 补充匿名类的好处
 * 5.内部类可以有多个实例,每个实例都有自己的状态信息,并且与其外部类对象的信息相互独立.
 * 6.在单个外部类中,可以让
 *  多个内部类以不同的方式实现用一个接口,或继承同一个类!! 划重点!🙃
 * 7.创建内部类对象时并不依赖外部类对象的创建.[Q:内部类何时创建的?A:感觉在外部类被调用时内部类就创建了]
 * 8.内部类并没有令人困惑的"is-a关系",它是一个独立的个体,独具灵活性.
 * */